Documents/ОперацияПоПлатежнойКарте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОперацияПоПлатежнойКарте</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорЭквайринга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторОплатыСБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БанкСБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОснованиеПлатежа</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаПогашения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВалютаВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОбъектРасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КурсЧислительВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МТМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Постоплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>KUPIVIP</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОперацияПоПлатежнойКарте/Forms/ФормаДокумента/Ext/Form/Module.bsl
функция долгклиента()
	текст = "";
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Сегменты.Партнер КАК Партнер,
	               |	ИСТИНА КАК ИспользуетсяОтборПоСегментуПартнеров
	               |ПОМЕСТИТЬ ОтборПоСегментуПартнеров
	               |ИЗ
	               |	РегистрСведений.ПартнерыСегмента КАК Сегменты
	               |{ГДЕ
	               |	Сегменты.Сегмент.* КАК СегментПартнеров,
	               |	Сегменты.Партнер.* КАК Партнер}
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Партнер,
	               |	ИспользуетсяОтборПоСегментуПартнеров
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	               |	АналитикаПоПартнерам.Партнер КАК Партнер,
	               |	АналитикаПоПартнерам.Контрагент КАК Контрагент,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыСКлиентами.КОплатеОстаток > 0
	               |				ТОГДА РасчетыСКлиентами.КОплатеОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КОплатеПросрочено,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыСКлиентамиНаСледующийДень.КОплатеОстаток < 0
	               |					И (РасчетыСКлиентамиНаСледующийДень.ЗаказКлиента ССЫЛКА Документ.ВозвратТоваровОтКлиента
	               |						ИЛИ РасчетыСКлиентамиНаСледующийДень.ЗаказКлиента ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	               |				ТОГДА -РасчетыСКлиентамиНаСледующийДень.КОплатеОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КВозвратуДСПросрочено,
	               |	СУММА(ВЫБОР
	               |			КОГДА РасчетыСКлиентами.КОтгрузкеОстаток < 0
	               |				ТОГДА -РасчетыСКлиентами.КОтгрузкеОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КОтгрузкеПросрочено
	               |ИЗ
	               |	РегистрНакопления.РасчетыСКлиентами.Остатки({(&ДатаОтчета)}, ) КАК РасчетыСКлиентами
	               |		{ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	               |		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики}
	               |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки({(ДОБАВИТЬКДАТЕ(&ДатаОтчета, СЕКУНДА, 1)) КАК Поле2}, ) КАК РасчетыСКлиентамиНаСледующийДень
	               |		ПО (РасчетыСКлиентамиНаСледующийДень.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам)
	               |			И (РасчетыСКлиентамиНаСледующийДень.ЗаказКлиента = РасчетыСКлиентами.ЗаказКлиента)
	               |			И (РасчетыСКлиентамиНаСледующийДень.Валюта = РасчетыСКлиентами.Валюта)}
	               |ГДЕ
	               |	АналитикаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	               |	И (РасчетыСКлиентами.КОплатеОстаток > 0
	               |			ИЛИ РасчетыСКлиентами.КОтгрузкеОстаток < 0
	               |			ИЛИ РасчетыСКлиентами.ОтгружаетсяОстаток < 0)
	               |	И (ВЫБОР
	               |				КОГДА РасчетыСКлиентами.КОплатеОстаток > 0
	               |					ТОГДА РасчетыСКлиентами.КОплатеОстаток
	               |				ИНАЧЕ 0
	               |			КОНЕЦ <> 0
	               |			ИЛИ ВЫБОР
	               |				КОГДА РасчетыСКлиентамиНаСледующийДень.КОплатеОстаток < 0
	               |						И (РасчетыСКлиентамиНаСледующийДень.ЗаказКлиента ССЫЛКА Документ.ВозвратТоваровОтКлиента
	               |							ИЛИ РасчетыСКлиентамиНаСледующийДень.ЗаказКлиента ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	               |					ТОГДА -РасчетыСКлиентамиНаСледующийДень.КОплатеОстаток
	               |				ИНАЧЕ 0
	               |			КОНЕЦ <> 0
	               |			ИЛИ ВЫБОР
	               |				КОГДА РасчетыСКлиентами.КОтгрузкеОстаток < 0
	               |					ТОГДА -РасчетыСКлиентами.КОтгрузкеОстаток
	               |				ИНАЧЕ 0
	               |			КОНЕЦ <> 0)
	               |	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Партнер = &Партнер
	               |	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
	               |{ГДЕ
	               |	(АналитикаПоПартнерам.Партнер В
	               |			(ВЫБРАТЬ
	               |				ОтборПоСегментуПартнеров.Партнер
	               |			ИЗ
	               |				ОтборПоСегментуПартнеров
	               |			ГДЕ
	               |				ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)) КАК Поле2}
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
	               |	АналитикаПоПартнерам.Партнер,
	               |	АналитикаПоПартнерам.Контрагент";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Контрагент", объект.Контрагент);
	выб = запрос.Выполнить().Выбрать();
	если выб.Следующий() тогда
		если выб.КОплатеПросрочено > 0 тогда
			текст = текст + символы.ПС + "Общая задолжность клиента составляет: " + строка(выб.КОплатеПросрочено) + "руб.";
		конецесли;
	конецесли;
	возврат текст;	
конецфункции

&НаКлиенте
Процедура BG_КонтрагентПриИзмененииПосле(Элемент)
	элементы.Долг.Заголовок = долгклиента();
КонецПроцедуры

&НаСервере
Процедура BG_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	если элементы.ХозяйственнаяОперация = предопределенноезначение("Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента") тогда
		элементы.Долг.Заголовок = долгклиента();
	конецесли;
	
	ТерминалыQR = Бабочка.ПолучитьЗначениеДинамическихНастроек("TinkoffQr_ЭквайринговыеТерминалы", Новый Массив);  
	Если ТерминалыQR = Объект.ЭквайринговыйТерминал 
		ИЛИ ТерминалыQR.Найти(Объект.ЭквайринговыйТерминал) <> Неопределено Тогда
		Элементы.ОплатитьПоQR.Видимость = Истина;
	Иначе
		Элементы.ОплатитьПоQR.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту") Тогда
		Элементы.ОплатитьПоQR.Заголовок = "Вернуть оплату по QR-коду";
	КонецЕсли;
	
	Если Элементы.ОплатитьПоQR.Видимость
		И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ОплатитьПоQR.Доступность = НЕ ОплатаПроизведенаУспешно();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
&Перед("ФискальнаяОперацияОбработкаНавигационнойСсылки")
Процедура BG_ФискальнаяОперацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если "ПробитьЧек" = НавигационнаяСсылка Тогда
		
		Если ЕстьТоварыМаркетПлейс() Тогда
			ВызватьИсключение "По данному документу НЕ требуется пробитие чека!";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&После("УстановитьВидимость")
Процедура BG_УстановитьВидимость()
	Элементы.Подразделение.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура BG_ПослеЗаписиПосле(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И ЭтоОплатаИМ() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопросПолученияКодаПодтверждения", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Отправить код подтверждения клиенту? (для ПВЗ)", РежимДиалогаВопрос.ДаНетОтмена,,,"Пункт выдачи заказа");
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоОплатаИМ()
	
	Возврат Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента 
				И Объект.РасшифровкаПлатежа[0].ОснованиеПлатежа.ВидЗаказа = Перечисления.ВидыЗаказов.ИМ; 
КонецФункции

&НаКлиенте
Процедура ПослеОтветаНаВопросПолученияКодаПодтверждения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда   	
		
		Если Результат = КодВозвратаДиалога.Да Тогда
			
			Структура = ОбновитьКодПодтвержденияНаСервере();
			
			Отправлено = ОтправитьСМСНаСервере(Структура);
			
			ОписаниеОповещенияПослеВыполнения = Новый ОписаниеОповещения("ПослеОтправкиСМС", ЭтаФорма);
			
			Если Отправлено Тогда
				ПоказатьПредупреждение(ОписаниеОповещенияПослеВыполнения, "SMS успешно отправлено", 5, "BABOCHKA");
			Иначе
				ПоказатьПредупреждение(ОписаниеОповещенияПослеВыполнения, "Ошибка отправки SMS", 5, "BABOCHKA");
			КонецЕсли;
			
			ПоказатьПредупреждение(ОписаниеОповещенияПослеВыполнения, "Код подтверждения - "+Структура.Код, 5, "BABOCHKA");

		Иначе
			
			Возврат;
			
		КонецЕсли;
				
	КонецЕсли;

КонецПроцедуры

Функция ОбновитьКодПодтвержденияНаСервере()
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(100000, 999999);
	Код = СтрЗаменить(СлучайноеЧисло, " ","");
	
	ЗаказКлиентаОбъекта = Объект.РасшифровкаПлатежа[0].ОснованиеПлатежа.ПолучитьОбъект();
	ЗаказКлиентаОбъекта.КодПодтвержденияПВЗ = Код;
	Попытка
		ЗаказКлиентаОбъекта.Записать();
	Исключение
		Сообщить("Ошибка записи кода подтверждения в заказ клиента!");	
	КонецПопытки;
	
	Структура = Новый Структура();
	Структура.Вставить("Код", Код);
	Структура.Вставить("НомерЗаказа", ЗаказКлиентаОбъекта.НомерПоДаннымКлиента);
	
	Возврат Структура;
	
КонецФункции

Функция ОтправитьСМСНаСервере(Структура)
	
	Возврат Бабочка.отправитьСМС(Объект.Партнер, "0", СтрШаблон("Ваш код подтверждения %1 для получения заказа %2  babochka.ru", Структура.Код, Структура.НомерЗаказа));

КонецФункции                                                              


&НаКлиенте
Процедура ПослеОтправкиСМС(ДополнительныеПараметры) Экспорт
	
	//
КонецПроцедуры


Функция ЕстьТоварыМаркетПлейс()
	
	MarketPlace_ПроверятьДокументыНаПробитиеЧека = Бабочка.ПолучитьЗначениеДинамическихНастроек("MarketPlace_ПроверятьДокументыНаПробитиеЧека", Ложь);
	
	Если MarketPlace_ПроверятьДокументыНаПробитиеЧека Тогда
		
		ДокЗаказ = Неопределено;
		Если ЗначениеЗаполнено(Объект.ДокументОснование) 
			И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			ДокЗаказ = Объект.ДокументОснование;
			
		ИначеЕсли Объект.РасшифровкаПлатежа.Количество()
			И ЗначениеЗаполнено(Объект.РасшифровкаПлатежа[0].ОснованиеПлатежа) 
			И ТипЗнч(Объект.РасшифровкаПлатежа[0].ОснованиеПлатежа) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
			ДокЗаказ = Объект.РасшифровкаПлатежа[0].ОснованиеПлатежа;
			
		КонецЕсли;
		
		Если ДокЗаказ = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура.ЭтоMarketPlace КАК НоменклатураЭтоMarketPlace
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура.ЭтоMarketPlace
		|	И НЕ ЗаказКлиентаТовары.Отменено
		|	И ЗаказКлиентаТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокЗаказ);
		
		MarketPlace = НЕ Запрос.Выполнить().Пустой();
		
		Возврат MarketPlace;		
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура BG_ЭквайринговыйТерминалПриИзмененииПосле(Элемент)
	
	ЭквайринговыйТерминалПриИзменении_НаСервере();
		
КонецПроцедуры

Процедура ЭквайринговыйТерминалПриИзменении_НаСервере()
	
	ТерминалыQR = Бабочка.ПолучитьЗначениеДинамическихНастроек("TinkoffQr_ЭквайринговыеТерминалы", Новый Массив);  
	Если ТерминалыQR = Объект.ЭквайринговыйТерминал 
		ИЛИ ТерминалыQR.Найти(Объект.ЭквайринговыйТерминал) <> Неопределено Тогда
		Элементы.ОплатитьПоQR.Видимость = Истина;
	Иначе
		Элементы.ОплатитьПоQR.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура BG_ОплатитьПоQRПосле(Команда)
	
	Если НЕ Объект.Проведен Тогда
		ПоказатьПредупреждение(,"Сначала проведите документ!",,"TINKOFF BANK");
		Возврат;
	КонецЕсли;
	
	//формируем QR
	ПараметрыДляОплаты = Новый Структура;
	ПараметрыДляОплаты.Вставить("Доплатить"		, Мин(ПолучитьОстатокСуммы(Объект.Ссылка), Объект.СуммаДокумента));//Объект.СуммаДокумента);
	ПараметрыДляОплаты.Вставить("ЧекККМ"		, ПолучитьДокументОснование(Объект.Ссылка));
	ПараметрыДляОплаты.Вставить("ЭтоВозврат"	, Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту"));
	ПараметрыДляОплаты.Вставить("ЭквайринговыйТерминал", Объект.ЭквайринговыйТерминал);
	ПараметрыДляОплаты.Вставить("ОснованиеВозврат", ПолучитьОснованиеВозврата(Объект.Ссылка));
	
	Если ПараметрыДляОплаты.ЭтоВозврат
		И Объект.СуммаДокумента > ПараметрыДляОплаты.Доплатить Тогда
		ТекстПредупреждения = "Сумма документа больше остатка оплаты "+ПараметрыДляОплаты.Доплатить+"!"+СИмволы.ПС+
								"Для возврата измените сначала сумму документа.";
		Предупреждение(ТекстПредупреждения);
		Возврат;
	КонецЕсли; 
	
	ОткрытьФорму(
			"ОбщаяФорма.ФормаОплатыПоQR",
			ПараметрыДляОплаты,
			ЭтотОбъект,,,,
			Новый ОписаниеОповещения("ПослеОплатыQR", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстатокСуммы(Ссылка)
	
	Если Ссылка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(ОплатыПоQRКодам_Tinkoff.Основание) = ТИП(Документ.ВозвратТоваровОтКлиента)
			|					ИЛИ ТИПЗНАЧЕНИЯ(ОплатыПоQRКодам_Tinkoff.Основание) = ТИП(Документ.ЧекККМВозврат)
			|				ТОГДА -ОплатыПоQRКодам_Tinkoff.Сумма
			|			ИНАЧЕ ОплатыПоQRКодам_Tinkoff.Сумма
			|		КОНЕЦ) КАК Сумма,
			|	ОплатыПоQRКодам_Tinkoff.ДокументОплаты КАК ДокументОплаты
			|ИЗ
			|	РегистрСведений.ОплатыПоQRКодам_Tinkoff КАК ОплатыПоQRКодам_Tinkoff
			|ГДЕ
			|	ОплатыПоQRКодам_Tinkoff.ДокументОплаты = &ДокументОплаты
			|
			|СГРУППИРОВАТЬ ПО
			|	ОплатыПоQRКодам_Tinkoff.ДокументОплаты";
		
		Запрос.УстановитьПараметр("ДокументОплаты", ПолучитьДокументОснование(Ссылка));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Сумма;
		КонецЦикла;
	Иначе
		Возврат Ссылка.СуммаДокумента;
	КонецЕсли;
	
КонецФункции
 
&НаСервереБезКонтекста
Функция ПолучитьОснованиеВозврата(Ссылка)
	Возврат ?(Ссылка.РасшифровкаПлатежа.Количество(), Ссылка.РасшифровкаПлатежа[0].Заказ, Ссылка)		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДокументОснование(Ссылка)
	
	Если Ссылка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
		
		ОснованиеЧек = Ссылка.РасшифровкаПлатежа[0].Заказ.ЧекККМ;
	    Если ЗначениеЗаполнено(ОснованиеЧек) Тогда
			Возврат ОснованиеЧек;	
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОперацияПоПлатежнойКарте.Ссылка КАК Ссылка
			|ИЗ
			|	РегистрСведений.ОплатыПоQRКодам_Tinkoff КАК ОплатыПоQRКодам_Tinkoff
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКарте
			|		ПО ОплатыПоQRКодам_Tinkoff.ДокументОплаты = ОперацияПоПлатежнойКарте.Ссылка
			|ГДЕ
			|	ОперацияПоПлатежнойКарте.Заказ В
			|			(ВЫБРАТЬ
			|				ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ.ДокументРеализации.ЗаказКлиента КАК Заказ
			|			ИЗ
			|				Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
			|			ГДЕ
			|				ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка = &Ссылка
			|				И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен)
			|	И ОперацияПоПлатежнойКарте.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
			|	И ОперацияПоПлатежнойКарте.Ссылка.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Возврат Ссылка;
		КонецЕсли; 
		
	Иначе
		Возврат Ссылка;
	КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура ПослеОплатыQR(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СуммаДокумента 		= Результат.Сумма;
	Объект.НомерПлатежнойКарты 	= Результат.НомерПлатежнойКарты;
	ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(Объект, Объект.СуммаДокумента, Ложь);
	СуммаДокументаПриИзмененииСервер();
	
	Записать();
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

Функция ОплатаПроизведенаУспешно()
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОплатыПоQRКодам_TinkoffСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ОплатыПоQRКодам_Tinkoff.СрезПоследних(
		|			,
		|			ДокументОплаты = &ДокументОплаты
		|				И Основание = &Основание) КАК ОплатыПоQRКодам_TinkoffСрезПоследних
		|ГДЕ
		|	(ОплатыПоQRКодам_TinkoffСрезПоследних.Статус = ""CONFIRMED""
		|			ИЛИ ОплатыПоQRКодам_TinkoffСрезПоследних.Статус = ""ASYNC_REFUNDING""
		|			ИЛИ ОплатыПоQRКодам_TinkoffСрезПоследних.Статус = ""PARTIAL_REFUNDED""
		|			ИЛИ ОплатыПоQRКодам_TinkoffСрезПоследних.Статус = ""REFUNDED"")";
	
	Основание = ?(Объект.Ссылка.РасшифровкаПлатежа.Количество(), Объект.Ссылка.РасшифровкаПлатежа[0].Заказ, Объект.Ссылка);
	Запрос.УстановитьПараметр("ДокументОплаты", ПолучитьДокументОснование(Объект.Ссылка));
	Запрос.УстановитьПараметр("Основание", Основание);
	
	ОплатаПроизведенаУспешно = НЕ Запрос.Выполнить().Пустой();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ОплатаПроизведенаУспешно;
	
КонецФункции

&НаКлиенте
Процедура BG_ПередЗакрытиемВместо(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ДействияНаФормеКлиент.ВыполнитьПроверкуНаЗакрытиеДокумента(ЭтаФорма, Отказ);
	ПринудительноЗакрытьФорму = Истина;
	
КонецПроцедуры
